### Handling Missing Values:
- Dropping Column
- Dropping Rows
- Various parameters in dropping functionalities
- Handling missing values by mean, median & mode

In [2]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Handling missing values').getOrCreate()

In [3]:
#reading the dataset
df_pyspark = spark.read.csv('test2.csv', header=True, inferSchema=True)

In [4]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|      NULL| 42000|
|   NULL|  34|        15| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

### Dropping Columns/Rows of missing value:

In [5]:
#dropping a column
df_pyspark.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  23|         8| 30000|
|  24|        10| 50000|
|  18|         2| 15000|
|  19|         4| 15000|
|  26|         6| 40000|
|  30|        13| 65000|
|NULL|      NULL| 42000|
|  34|        15| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

In [6]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|      NULL| 42000|
|   NULL|  34|        15| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [7]:
#dropping specific rows
df_pyspark.na.drop().show()

#using na with drop, will remove all the NULL values

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Radhika| 23|         8| 30000|
| Shivam| 24|        10| 50000|
|  Aashi| 18|         2| 15000|
| Mayank| 19|         4| 15000|
| Millie| 26|         6| 40000|
|    Tom| 30|        13| 65000|
+-------+---+----------+------+

### How:
- If (how=any)
-> dropped if it contains any null, (by default)

- If (how=all)
-> dropped if all values are null

In [8]:
#how=any
df_pyspark.na.drop(how="any").show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Radhika| 23|         8| 30000|
| Shivam| 24|        10| 50000|
|  Aashi| 18|         2| 15000|
| Mayank| 19|         4| 15000|
| Millie| 26|         6| 40000|
|    Tom| 30|        13| 65000|
+-------+---+----------+------+

In [9]:
#how=all
df_pyspark.na.drop(how="all").show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|      NULL| 42000|
|   NULL|  34|        15| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

### Threshold:
Sets the limit for non-null values

- If thresh=2, then atleast 2 non-null values must be present in the row, if not then dropped

In [10]:
df_pyspark.na.drop(how="any", thresh=2).show()
#drops the last row because it just contains 1 Non-null value

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|      NULL| 42000|
|   NULL|  34|        15| 38000|
+-------+----+----------+------+

### Subset:
Dropping values from a specific column

In [11]:
df_pyspark.na.drop(how="any", subset=['Experience']).show()  
#drops null values from the Experience column only

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Radhika| 23|         8| 30000|
| Shivam| 24|        10| 50000|
|  Aashi| 18|         2| 15000|
| Mayank| 19|         4| 15000|
| Millie| 26|         6| 40000|
|    Tom| 30|        13| 65000|
|   NULL| 34|        15| 38000|
+-------+---+----------+------+

### Filling the Missing Values:

In [16]:
#using fill - (value,subset)
#using value only

#for string columns
df_pyspark.na.fill('Missing Values').show()

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|       Radhika|  23|         8| 30000|
|        Shivam|  24|        10| 50000|
|         Aashi|  18|         2| 15000|
|        Mayank|  19|         4| 15000|
|        Millie|  26|         6| 40000|
|           Tom|  30|        13| 65000|
|        Shreya|NULL|      NULL| 42000|
|Missing Values|  34|        15| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [13]:
#for numerical columns
df_pyspark.na.fill(0).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Radhika| 23|         8| 30000|
| Shivam| 24|        10| 50000|
|  Aashi| 18|         2| 15000|
| Mayank| 19|         4| 15000|
| Millie| 26|         6| 40000|
|    Tom| 30|        13| 65000|
| Shreya|  0|         0| 42000|
|   NULL| 34|        15| 38000|
|   NULL| 36|         0|     0|
+-------+---+----------+------+

In [18]:
#for both String and Numerical columns/combined filling

df_filling = df_pyspark.na.fill('Missing Values')
df_filling.na.fill(0).show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|       Radhika| 23|         8| 30000|
|        Shivam| 24|        10| 50000|
|         Aashi| 18|         2| 15000|
|        Mayank| 19|         4| 15000|
|        Millie| 26|         6| 40000|
|           Tom| 30|        13| 65000|
|        Shreya|  0|         0| 42000|
|Missing Values| 34|        15| 38000|
|Missing Values| 36|         0|     0|
+--------------+---+----------+------+

In [19]:
#using fill in a specific column
#using value + subset
df_pyspark.na.fill(0, 'Experience').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|         0| 42000|
|   NULL|  34|        15| 38000|
|   NULL|  36|         0|  NULL|
+-------+----+----------+------+

In [20]:
df_pyspark.na.fill(0, ['Experience', 'Age']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Radhika| 23|         8| 30000|
| Shivam| 24|        10| 50000|
|  Aashi| 18|         2| 15000|
| Mayank| 19|         4| 15000|
| Millie| 26|         6| 40000|
|    Tom| 30|        13| 65000|
| Shreya|  0|         0| 42000|
|   NULL| 34|        15| 38000|
|   NULL| 36|         0|  NULL|
+-------+---+----------+------+

In [22]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Radhika|  23|         8| 30000|
| Shivam|  24|        10| 50000|
|  Aashi|  18|         2| 15000|
| Mayank|  19|         4| 15000|
| Millie|  26|         6| 40000|
|    Tom|  30|        13| 65000|
| Shreya|NULL|      NULL| 42000|
|   NULL|  34|        15| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

### Filling Missing values using Mean, Median & Mode:

Mean:

In [24]:
#using Imputer function 

from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]).setStrategy("mean")

In [26]:
#adding Imputation Columns to df
#fit & transform

imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Radhika|  23|         8| 30000|         23|                 8|         30000|
| Shivam|  24|        10| 50000|         24|                10|         50000|
|  Aashi|  18|         2| 15000|         18|                 2|         15000|
| Mayank|  19|         4| 15000|         19|                 4|         15000|
| Millie|  26|         6| 40000|         26|                 6|         40000|
|    Tom|  30|        13| 65000|         30|                13|         65000|
| Shreya|NULL|      NULL| 42000|         26|                 8|         42000|
|   NULL|  34|        15| 38000|         34|                15|         38000|
|   NULL|  36|      NULL|  NULL|         36|                 8|         36875|
+-------+----+----------+------+-----------+------------------+--------------+

Median:

In [27]:
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]).setStrategy("median")

In [28]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Radhika|  23|         8| 30000|         23|                 8|         30000|
| Shivam|  24|        10| 50000|         24|                10|         50000|
|  Aashi|  18|         2| 15000|         18|                 2|         15000|
| Mayank|  19|         4| 15000|         19|                 4|         15000|
| Millie|  26|         6| 40000|         26|                 6|         40000|
|    Tom|  30|        13| 65000|         30|                13|         65000|
| Shreya|NULL|      NULL| 42000|         24|                 8|         42000|
|   NULL|  34|        15| 38000|         34|                15|         38000|
|   NULL|  36|      NULL|  NULL|         36|                 8|         38000|
+-------+----+----------+------+-----------+------------------+--------------+

Mode:

In [30]:
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]).setStrategy("mode")

In [31]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Radhika|  23|         8| 30000|         23|                 8|         30000|
| Shivam|  24|        10| 50000|         24|                10|         50000|
|  Aashi|  18|         2| 15000|         18|                 2|         15000|
| Mayank|  19|         4| 15000|         19|                 4|         15000|
| Millie|  26|         6| 40000|         26|                 6|         40000|
|    Tom|  30|        13| 65000|         30|                13|         65000|
| Shreya|NULL|      NULL| 42000|         18|                 2|         42000|
|   NULL|  34|        15| 38000|         34|                15|         38000|
|   NULL|  36|      NULL|  NULL|         36|                 2|         15000|
+-------+----+----------+------+-----------+------------------+--------------+